;
; Note: shader requires additional functionality:
;       Use native low precision
;
; shader debug name: d261a0b234bcd862c8f2920effb8e419.pdb
; shader hash: d261a0b234bcd862c8f2920effb8e419
;
; Buffer Definitions:
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
;
target datalayout = "e-m:e-p:32:32-i1:32-i8:8-i16:16-i32:32-i64:64-f16:16-f32:32-f64:64-n8:16:32:64"
target triple = "dxil-ms-dx"

%0 = type { void (i32)*, i32 (i32, i32, i8**, i32, i32)*, void (i32, i32*, i32)*, void (i32, i32, i32, i32, i32, i32, i32)*, void (i32, i32, i8*, i32)*, void (i8*, i32, i32*, i32)*, i32 (i32, i32, i32, i32, i32, i32, i32, i32, i32, i32, i32)*, void (i32, i8*, i32)*, void (i32, i8*)*, i32 (i32, i32)*, i32 (i32, i32, i32)*, i32 (i32, i32, i32, i32)*, float (i32, float)*, float (i32, float, float)*, float (i32, float, float, float)*, i1 (i32, float)*, void (i32, i32, i32, i32, i8*)*, void (i8*, i32, i32, i32, i32)*, i8* (i32, i32)* }
%1 = type { i32, i32, i32, i32 }
%___rpsl_node_info_struct = type <{ i32, i32, i32, i32, i32 }>
%___rpsl_entry_desc_struct = type <{ i32, i32, i32, i32, i8*, i8* }>
%___rpsl_type_info_struct = type <{ i8, i8, i8, i8, i32, i32, i32 }>
%___rpsl_params_info_struct = type <{ i32, i32, i32, i32, i32, i16, i16 }>
%___rpsl_shader_ref_struct = type <{ i32, i32, i32, i32 }>

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.7.0.3789 (rps-merge-dxc1_7_2212_squash, b8686eeb8)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !22, globals: !97)
!1 = !DIFile(filename: "C:\5C\5CUsers\5C\5CFlorian\5C\5Csource\5C\5Crepos\5C\5CRPS\5C\5Crender-pipeline-shaders\5C\5Cexamples\5C\5Chello_triangle.rpsl", directory: "")
!2 = !{}
!3 = !{!4, !6, !18, !10, !20}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !1, line: 165, baseType: !5)
!5 = !DIBasicType(name: "uint64_t", size: 64, align: 64, encoding: DW_ATE_unsigned)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 14, baseType: !7)
!7 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 14, size: 128, align: 32, elements: !8, templateParams: !14)
!8 = !{!9, !11, !12, !13}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !7, file: !1, line: 14, baseType: !10, size: 32, align: 32, flags: DIFlagPublic)
!10 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !7, file: !1, line: 14, baseType: !10, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !7, file: !1, line: 14, baseType: !10, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !7, file: !1, line: 14, baseType: !10, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!14 = !{!15, !16}
!15 = !DITemplateTypeParameter(name: "element", type: !10)
!16 = !DITemplateValueParameter(name: "element_count", type: !17, value: i32 4)
!17 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !1, line: 26, baseType: !19)
!19 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !1, line: 128, baseType: !21)
!21 = !DIBasicType(name: "uint16_t", size: 16, align: 16, encoding: DW_ATE_unsigned)
!22 = !{!23, !63, !78, !81, !84, !88, !91}
!23 = !DISubprogram(name: "make_default_texture_view_from_desc", linkageName: "\01?make_default_texture_view_from_desc@@YA?AUtexture@@IUResourceDesc@@@Z", scope: !24, file: !24, line: 152, type: !25, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.texture*, i32, %struct.ResourceDesc*)* @"\01?make_default_texture_view_from_desc@@YA?AUtexture@@IUResourceDesc@@@Z")
!24 = !DIFile(filename: "C:\5C\5CUsers\5C\5CFlorian\5C\5Csource\5C\5Crepos\5C\5CRPS\5C\5Crender-pipeline-shaders\5C\5Cexamples/___rpsl_builtin_header_.rpsl", directory: "")
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !51, !52}
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "texture", file: !1, size: 288, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !40, !41, !42, !45, !48}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "Resource", scope: !27, file: !1, baseType: !19, size: 32, align: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "ViewFormat", scope: !27, file: !1, baseType: !19, size: 32, align: 32, offset: 32)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayer", scope: !27, file: !1, baseType: !19, size: 32, align: 32, offset: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !27, file: !1, baseType: !19, size: 32, align: 32, offset: 96)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "SubresourceRange", scope: !27, file: !1, baseType: !34, size: 96, align: 32, offset: 128)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "SubresourceRange", file: !1, size: 96, align: 32, elements: !35)
!35 = !{!36, !37, !38, !39}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "base_mip_level", scope: !34, file: !1, baseType: !21, size: 16, align: 16)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "mip_level_count", scope: !34, file: !1, baseType: !21, size: 16, align: 16, offset: 16)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "base_array_layer", scope: !34, file: !1, baseType: !19, size: 32, align: 32, offset: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "array_layer_count", scope: !34, file: !1, baseType: !19, size: 32, align: 32, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "MinLodClamp", scope: !27, file: !1, baseType: !10, size: 32, align: 32, offset: 224)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "ComponentMapping", scope: !27, file: !1, baseType: !19, size: 32, align: 32, offset: 256)
!42 = !DISubprogram(name: "create1D", linkageName: "\01?create1D@texture@@SA?AU1@IIIIII@Z", scope: !27, file: !1, type: !43, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!27, !19, !19, !19, !19, !19, !19}
!45 = !DISubprogram(name: "create2D", linkageName: "\01?create2D@texture@@SA?AU1@IIIIIIIII@Z", scope: !27, file: !1, type: !46, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!46 = !DISubroutineType(types: !47)
!47 = !{!27, !19, !19, !19, !19, !19, !19, !19, !19, !19}
!48 = !DISubprogram(name: "create3D", linkageName: "\01?create3D@texture@@SA?AU1@IIIIIII@Z", scope: !27, file: !1, type: !49, isLocal: false, isDefinition: false, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!27, !19, !19, !19, !19, !19, !19, !19}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !19)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "ResourceDesc", file: !1, size: 288, align: 32, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59, !60, !61, !62}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "Type", scope: !52, file: !1, baseType: !19, size: 32, align: 32)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayers", scope: !52, file: !1, baseType: !19, size: 32, align: 32, offset: 32)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !52, file: !1, baseType: !19, size: 32, align: 32, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "Width", scope: !52, file: !1, baseType: !19, size: 32, align: 32, offset: 96)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "Height", scope: !52, file: !1, baseType: !19, size: 32, align: 32, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "DepthOrArraySize", scope: !52, file: !1, baseType: !19, size: 32, align: 32, offset: 160)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "MipLevels", scope: !52, file: !1, baseType: !19, size: 32, align: 32, offset: 192)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "Format", scope: !52, file: !1, baseType: !19, size: 32, align: 32, offset: 224)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "SampleCount", scope: !52, file: !1, baseType: !19, size: 32, align: 32, offset: 256)
!63 = !DISubprogram(name: "make_default_buffer_view_from_desc", linkageName: "\01?make_default_buffer_view_from_desc@@YA?AUbuffer@@IUResourceDesc@@@Z", scope: !24, file: !24, line: 161, type: !64, isLocal: false, isDefinition: true, scopeLine: 162, flags: DIFlagPrototyped, isOptimized: false)
!64 = !DISubroutineType(types: !65)
!65 = !{!66, !51, !52}
!66 = !DICompositeType(tag: DW_TAG_structure_type, name: "buffer", file: !1, line: 159, size: 320, align: 64, elements: !67)
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "Resource", scope: !66, file: !1, line: 159, baseType: !19, size: 32, align: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "ViewFormat", scope: !66, file: !1, line: 159, baseType: !19, size: 32, align: 32, offset: 32)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "TemporalLayer", scope: !66, file: !1, line: 159, baseType: !19, size: 32, align: 32, offset: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "Flags", scope: !66, file: !1, line: 159, baseType: !19, size: 32, align: 32, offset: 96)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "Offset", scope: !66, file: !1, line: 159, baseType: !5, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "SizeInBytes", scope: !66, file: !1, line: 159, baseType: !5, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "Stride", scope: !66, file: !1, line: 159, baseType: !19, size: 32, align: 32, offset: 256)
!75 = !DISubprogram(name: "create", linkageName: "\01?create@buffer@@SA?AU1@_KII@Z", scope: !66, file: !1, line: 159, type: !76, isLocal: false, isDefinition: false, scopeLine: 159, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubroutineType(types: !77)
!77 = !{!66, !5, !19, !19}
!78 = !DISubprogram(name: "main", linkageName: "\01?main@@YAXUtexture@@@Z", scope: !1, file: !1, line: 11, type: !79, isLocal: false, isDefinition: true, scopeLine: 12, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.texture*)* @rpsl_M_hello_triangle_Fn_main)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !27}
!81 = !DISubprogram(name: "mainBreathing", linkageName: "\01?mainBreathing@@YAXUtexture@@M@Z", scope: !1, file: !1, line: 22, type: !82, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void (%struct.texture*, float)* @rpsl_M_hello_triangle_Fn_mainBreathing)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !27, !10}
!84 = !DISubprogram(name: "make_default_texture_view", linkageName: "\01?make_default_texture_view@@YA?AUtexture@@IIII@Z", scope: !24, file: !24, line: 119, type: !85, isLocal: false, isDefinition: true, scopeLine: 120, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{!27, !51, !87, !51, !51}
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "RPS_FORMAT", file: !1, line: 34, baseType: !19)
!88 = !DISubprogram(name: "make_default_buffer_view", linkageName: "\01?make_default_buffer_view@@YA?AUbuffer@@I_K@Z", scope: !24, file: !24, line: 137, type: !89, isLocal: false, isDefinition: true, scopeLine: 138, flags: DIFlagPrototyped, isOptimized: false)
!89 = !DISubroutineType(types: !90)
!90 = !{!66, !51, !4}
!91 = !DISubprogram(name: "clear", linkageName: "\01?clear@@YA?AUnodeidentifier@@Utexture@@V?$vector@M$03@@@Z", scope: !24, file: !24, line: 292, type: !92, isLocal: false, isDefinition: true, scopeLine: 293, flags: DIFlagPrototyped, isOptimized: false)
!92 = !DISubroutineType(types: !93)
!93 = !{!94, !27, !6}
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "nodeidentifier", file: !24, line: 2, size: 32, align: 32, elements: !95)
!95 = !{!96}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "unused", scope: !94, file: !24, line: 2, baseType: !51, size: 32, align: 32)
!97 = !{!98, !100, !101}
!98 = !DIGlobalVariable(name: "RPS_RESOURCE_TEX3D", scope: !0, file: !1, line: 157, type: !99, isLocal: true, isDefinition: true, variable: i32 4)
!99 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !19)
!100 = !DIGlobalVariable(name: "RPS_FORMAT_UNKNOWN", scope: !0, file: !1, line: 124, type: !99, isLocal: true, isDefinition: true, variable: i32 0)
!101 = !DIGlobalVariable(name: "___rpsl_pso_tmp", scope: !0, file: !24, line: 361, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pipeline", file: !1, line: 361, size: 32, align: 32, elements: !103)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "h", scope: !102, file: !1, line: 361, baseType: !17, size: 32, align: 32, flags: DIFlagPrivate)
!105 = !{i32 2, !"Dwarf Version", i32 4}
!106 = !{i32 2, !"Debug Info Version", i32 3}
!107 = !{!"dxc(private) 1.7.0.3789 (rps-merge-dxc1_7_2212_squash, b8686eeb8)"}
